[Killed] BlockStatement
src/operacoes.js:17:22
   return Math.sqrt(n);
 }
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
-function fatorial(n) {
-  if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-  // Stryker disable next-line ConditionalExpression,LogicalOperator: mutante equivalente - o loop abaixo já retorna 1 para n=0 e n=1.
-  if (n === 0 || n === 1) return 1;
-  let resultado = 1;
-  for (let i = 2; i <= n; i++) { resultado *= i; }
-  return resultado;
-}
+function fatorial(n) {}
 function mediaArray(numeros) {
   if (numeros.length === 0) return 0;
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:20:7
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   // Stryker disable next-line ConditionalExpression,LogicalOperator: mutante equivalente - o loop abaixo já retorna 1 para n=0 e n=1.
-  if (n === 0 || n === 1) return 1;
+  if (n !== 0 || n === 1) return 1;
   let resultado = 1;
   for (let i = 2; i <= n; i++) { resultado *= i; }
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] EqualityOperator
src/operacoes.js:20:18
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   // Stryker disable next-line ConditionalExpression,LogicalOperator: mutante equivalente - o loop abaixo já retorna 1 para n=0 e n=1.
-  if (n === 0 || n === 1) return 1;
+  if (n === 0 || n !== 1) return 1;
   let resultado = 1;
   for (let i = 2; i <= n; i++) { resultado *= i; }
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] BlockStatement
src/operacoes.js:34:31
 }
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
-function maximoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio não possui valor máximo.');
-  return Math.max(...numeros);
-}
+function maximoArray(numeros) {}
 function minimoArray(numeros) {
   if (numeros.length === 0) throw new Error('Array vazio não possui valor mínimo.');
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 11. deve encontrar o valor máximo em um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:35:7
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio não possui valor máximo.');
+  if (true) throw new Error('Array vazio não possui valor máximo.');
   return Math.max(...numeros);
 }
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 11. deve encontrar o valor máximo em um array
statusReason: Error: Array vazio não possui valor máximo.

[Killed] EqualityOperator
src/operacoes.js:35:7
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio não possui valor máximo.');
+  if (numeros.length !== 0) throw new Error('Array vazio não possui valor máximo.');
   return Math.max(...numeros);
 }
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 11. deve encontrar o valor máximo em um array
statusReason: Error: Array vazio não possui valor máximo.

[Killed] BlockStatement
src/operacoes.js:38:31
   if (numeros.length === 0) throw new Error('Array vazio não possui valor máximo.');
   return Math.max(...numeros);
 }
-function minimoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio não possui valor mínimo.');
-  return Math.min(...numeros);
-}
+function minimoArray(numeros) {}
 function valorAbsoluto(n) { return Math.abs(n); }
 function arredondar(n) { return Math.round(n); }
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 12. deve encontrar o valor mínimo em um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:39:7
   return Math.max(...numeros);
 }
 function minimoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio não possui valor mínimo.');
+  if (numeros.length !== 0) throw new Error('Array vazio não possui valor mínimo.');
   return Math.min(...numeros);
 }
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 12. deve encontrar o valor mínimo em um array
statusReason: Error: Array vazio não possui valor mínimo.

[Killed] ConditionalExpression
src/operacoes.js:39:7
   return Math.max(...numeros);
 }
 function minimoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio não possui valor mínimo.');
+  if (true) throw new Error('Array vazio não possui valor mínimo.');
   return Math.min(...numeros);
 }
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 12. deve encontrar o valor mínimo em um array
statusReason: Error: Array vazio não possui valor mínimo.

[Killed] BlockStatement
src/operacoes.js:84:32
   if (n <= 1) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
-function produtoArray(numeros) {
-  // Stryker disable next-line ConditionalExpression: mutante equivalente - reduce com valor inicial 1 já retorna 1 para array vazio.
-  if (numeros.length === 0) return 1;
-  return numeros.reduce((acc, val) => acc * val, 1);
-}
+function produtoArray(numeros) {}
 function clamp(valor, min, max) {
   // Stryker disable next-line EqualityOperator: mutante equivalente - quando valor === min, retornar min é igual a retornar valor.
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:86:7
 }
 function produtoArray(numeros) {
   // Stryker disable next-line ConditionalExpression: mutante equivalente - reduce com valor inicial 1 já retorna 1 para array vazio.
-  if (numeros.length === 0) return 1;
+  if (numeros.length !== 0) return 1;
   return numeros.reduce((acc, val) => acc * val, 1);
 }
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] BlockStatement
src/operacoes.js:89:33
   if (numeros.length === 0) return 1;
   return numeros.reduce((acc, val) => acc * val, 1);
 }
-function clamp(valor, min, max) {
-  // Stryker disable next-line EqualityOperator: mutante equivalente - quando valor === min, retornar min é igual a retornar valor.
-  if (valor < min) return min;
-  // Stryker disable next-line EqualityOperator: mutante equivalente - quando valor === max, retornar max é igual a retornar valor.
-  if (valor > max) return max;
-  return valor;
-}
+function clamp(valor, min, max) {}
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:91:7
 }
 function clamp(valor, min, max) {
   // Stryker disable next-line EqualityOperator: mutante equivalente - quando valor === min, retornar min é igual a retornar valor.
-  if (valor < min) return min;
+  if (false) return min;
   // Stryker disable next-line EqualityOperator: mutante equivalente - quando valor === max, retornar max é igual a retornar valor.
   if (valor > max) return max;
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 86. clamp abaixo do mínimo retorna o mínimo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -5

[Killed] ConditionalExpression
src/operacoes.js:91:7
 }
 function clamp(valor, min, max) {
   // Stryker disable next-line EqualityOperator: mutante equivalente - quando valor === min, retornar min é igual a retornar valor.
-  if (valor < min) return min;
+  if (true) return min;
   // Stryker disable next-line EqualityOperator: mutante equivalente - quando valor === max, retornar max é igual a retornar valor.
   if (valor > max) return max;
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/operacoes.js:93:7
   // Stryker disable next-line EqualityOperator: mutante equivalente - quando valor === min, retornar min é igual a retornar valor.
   if (valor < min) return min;
   // Stryker disable next-line EqualityOperator: mutante equivalente - quando valor === max, retornar max é igual a retornar valor.
-  if (valor > max) return max;
+  if (true) return max;
   return valor;
 }
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] ConditionalExpression
src/operacoes.js:93:7
   // Stryker disable next-line EqualityOperator: mutante equivalente - quando valor === min, retornar min é igual a retornar valor.
   if (valor < min) return min;
   // Stryker disable next-line EqualityOperator: mutante equivalente - quando valor === max, retornar max é igual a retornar valor.
-  if (valor > max) return max;
+  if (false) return max;
   return valor;
 }
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 87. clamp acima do máximo retorna o máximo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 15

[Killed] BlockStatement
src/operacoes.js:111:32
 function isMaiorQue(a, b) { return a > b; }
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
-function medianaArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio não possui mediana.');
-  const sorted = [...numeros].sort((a, b) => a - b);
-  const mid = Math.floor(sorted.length / 2);
-  if (sorted.length % 2 === 0) {
-    return (sorted[mid - 1] + sorted[mid]) / 2;
-  }
-  return sorted[mid];
-}
+function medianaArray(numeros) {}
 function dobro(n) { return n * 2; }
 function triplo(n) { return n * 3; }
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 47. deve calcular a mediana de um array ímpar e ordenado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:112:7
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio não possui mediana.');
+  if (numeros.length !== 0) throw new Error('Array vazio não possui mediana.');
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 47. deve calcular a mediana de um array ímpar e ordenado
statusReason: Error: Array vazio não possui mediana.

[Killed] ConditionalExpression
src/operacoes.js:112:7
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio não possui mediana.');
+  if (false) throw new Error('Array vazio não possui mediana.');
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 57. medianaArray vazio deve lançar erro com mensagem específica
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Array vazio não possui mediana."

Received function did not throw

[Killed] ArithmeticOperator
src/operacoes.js:113:46
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
   if (numeros.length === 0) throw new Error('Array vazio não possui mediana.');
-  const sorted = [...numeros].sort((a, b) => a - b);
+  const sorted = [...numeros].sort((a, b) => a + b);
   const mid = Math.floor(sorted.length / 2);
   if (sorted.length % 2 === 0) {
killedBy: Suíte de Testes Aprimorada para 50 Operações Aritméticas 102. medianaArray desordenado deve ordenar antes de calcular
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 2
